---
type: ProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 6
tags: [revit-api, class]
---

# ProgressChangedEventArgs

`Autodesk.Revit.DB.Events.ProgressChangedEventArgs` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Cancel | 2013 | `public void Cancel ()` |
| Property | Caption | 2013 | `public string Caption { get ; }` |
| Property | LowerRange | 2013 | `public int LowerRange { get ; }` |
| Property | Position | 2013 | `public int Position { get ; }` |
| Property | Stage | 2013 | `public ProgressStage Stage { get ; }` |
| Property | UpperRange | 2013 | `public int UpperRange { get ; }` |